Documents/ВводОбъемаПотребленияГВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводОбъемаПотребленияГВ</Name>
			<Comment>Завантаження та рознесення об'єму спожитої гараячої води з даних наданих тепломережею.</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЕксель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьОбъем</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛСТеплосеть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квартира</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводОбъемаПотребленияГВ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЕксель;
	Фильтр = "Электронная таблица Excel(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлЕксель = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Путь = Объект.ФайлЕксель;
	Объект.ТабличнаяЧастьОбъем.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 4 По КоличествоСтрок Цикл
		НоваяСтрока                  = Объект.ТабличнаяЧастьОбъем.Добавить();
		НоваяСтрока.ЛСТеплосеть      = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Адрес            = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.Улица            = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Дом              = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.Квартира         = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.Объем            = Excel.Cells(Счетчик, 6).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиВодоканалаНаСервере()
	
	Для Каждого стр Из Объект.ТабличнаяЧастьОбъем Цикл
		// Поищем по абонномеру теплосети
	    ЛСПоТеплосети = АбонномерТеплосеть(СтрЗаменить(Строка(стр.ЛСТеплосеть), Символы.НПП, ""));
		Если ЛСПоТеплосети <> Неопределено Тогда
			стр.ЛицевойСчет = ЛСПоТеплосети;
		    ПриборУчета = НайтиПриборУчета(ЛСПоТеплосети);
		    Если ПриборУчета <> Неопределено Тогда		    
				стр.ПриборУчета = ПриборУчета;
			КонецЕсли;
		Иначе
			// Поищем абонента по адресу
			ЛС_Адрес = АбонномерПоАдресу(стр.Адрес, стр.Квартира);
			Если ЛС_Адрес <> Неопределено Тогда
				стр.ЛицевойСчет = ЛС_Адрес;
				ПриборУчета = НайтиПриборУчета(ЛСПоТеплосети);
			    Если ПриборУчета <> Неопределено Тогда				    
					стр.ПриборУчета = ПриборУчета;
				КонецЕсли;
				// Добавим лицевой счет теплосети
				СправочникЛС = ЛС_Адрес.Ссылка.ПолучитьОбъект();
				СправочникЛС.ЛицевойСчетТеплосеть = СтрЗаменить(Строка(стр.ЛСТеплосеть), Символы.НПП, "");
				СправочникЛС.Записать();
			КонецЕсли;
	    КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДаннымиВодоканала(Команда)
	ЗаполнитьДаннымиВодоканалаНаСервере();
КонецПроцедуры


//////////////////////////////////// ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ /////////////////////

&НаСервере
Функция АбонномерТеплосеть(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ЛицевойСчет.ЛицевойСчетТеплосеть = &ЛицевойСчетТеплосеть) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЛицевойСчетТеплосеть", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий()Цикл
			ЛС = Выборка.ЛицевойСчет;
		КонецЦикла;
		Возврат ЛС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция НайтиПриборУчета(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	    |			&НаДату,
	    |			ОбъектУстановки = &ОбъектУстановки
	    |				И Действует = ИСТИНА
	    |				И ПриборУчета.Услуга.ВидУслуги = &ВидУслуги) КАК УстановленныеПриборыУчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.Водоотведение);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий()Цикл
			ПУ = Выборка.ПриборУчета;
		КонецЦикла;
		Возврат ПУ;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
КонецФункции

&НаСервере
Функция АбонномерПоАдресу(Адрес, Квартира)
	Здание = Справочники.ЗданияИСооружения.НайтиПоНаименованию(Адрес);
	_Квартира = Справочники.ОбъектыЛицевыхСчетов.НайтиПоКоду(Квартира);
	
	ЗапросКв = Новый Запрос;
	ЗапросКв.Текст =
	    "ВЫБРАТЬ
	    |	ОбъектыЛицевыхСчетов.Ссылка
	    |ИЗ
	    |	Справочник.ОбъектыЛицевыхСчетов КАК ОбъектыЛицевыхСчетов
	    |ГДЕ
	    |	ОбъектыЛицевыхСчетов.Владелец = &Владелец
	    |	И ОбъектыЛицевыхСчетов.Код = &Код
	    |	И ОбъектыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ";
	ЗапросКв.УстановитьПараметр("Владелец", Здание);
	ЗапросКв.УстановитьПараметр("Код", Число(Квартира));
	Результат = ЗапросКв.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектЛС = Выборка.Ссылка;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ЛицевойСчет.Владелец = &Владелец
	    |				И ЛицевойСчет.ОбъектЛицевогоСчета = &Квартира) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Владелец", Здание);
	Запрос.УстановитьПараметр("Квартира", ОбъектЛС);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий()Цикл
			ЛС = Выборка.ЛицевойСчет;
		КонецЦикла;
		Возврат ЛС;
	Иначе
	    Сообщить("Адресу не знайдено: " + Адрес + " кв." + Квартира);
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
